
//22.	Ввести число в диапазоне от 0 до 1000000. Озвучить его словами. Например, при вводе числа 25 вывести на экране «двадцать пять».


#include <iostream>
using namespace std;

int main()
{
	system("chcp 1251 > 0");
	
		string s, s1, s2, s3, s4, s5, s6;
		int n,
			y = 1;

		cout << "Введите число от 0 до 1000000: ";
		cin >> n;
		for (y; y <= n / 10; y *= 10);

		int x;
		if (y == 100000)
		{
			x = n / y;
			if (x == 9) s1 = "Девятьсот ";
			else if (x == 8) s1 = "Восемьсот ";
			else if (x == 7) s1 = "Семьсот ";
			else if (x == 6) s1 = "Шестьсот ";
			else if (x == 5) s1 = "Пятьсот ";
			else if (x == 4) s1 = "Четыреста ";
			else if (x == 3) s1 = "Триста ";
			else if (x == 2) s1 = "Двесте ";
			else if (x == 1) s1 = "Сто ";
			y = y / 10;
			n = n - (x * 100000);
		}

		if (y == 10000)
		{
			x = n / y;
			if (x == 9) s2 = "Девяносто ";
			else if (x == 8) s2 = "Восемьдесят ";
			else if (x == 7) s2 = "Семьдесят ";
			else if (x == 6) s2 = "Шестьдесят ";
			else if (x == 5) s2 = "Пятьдесят ";
			else if (x == 4) s2 = "Сорок ";
			else if (x == 3) s2 = "Тридцать ";
			else if (x == 2) s2 = "Двадцать ";
			else if (x == 1)
			{
				y = y / 10;
				n = n - (x * 10000);
				x = n / y;
				if (x == 9) s2 = "Девятнадцать тысяч ";
				else if (x == 8) s2 = "Восемнадцать тысяч ";
				else if (x == 7) s2 = "Семнадцать тысяч ";
				else if (x == 6) s2 = "Шестнадцать тысяч ";
				else if (x == 5) s2 = "Пятнадцать тысяч ";
				else if (x == 4) s2 = "Четырнадцать тысяч ";
				else if (x == 3) s2 = "Тринадцать тысяч ";
				else if (x == 2) s2 = "Двенадцать тысяч ";
				else if (x == 1) s2 = "Одинадцать тысяч ";
				else if (x == 0) s2 = "Десять тысяч ";
				y = y / 10;
				n = n - (x * 1000);
			}
			if (y == 10000)
			{
				y = y / 10;
				n = n - (x * 10000);
			}
		}

		if (y == 1000)
		{
			x = n / y;
			if (x == 9) s3 = "Девять тысяч ";
			else if (x == 8) s3 = "Восемь тысяч ";
			else if (x == 7) s3 = "Семь тысяч ";
			else if (x == 6) s3 = "Шесть тысяч ";
			else if (x == 5) s3 = "Пять тысяч ";
			else if (x == 4) s3 = "Четыре тысячи ";
			else if (x == 3) s3 = "Три тысячи ";
			else if (x == 2) s3 = "Две тысячи ";
			else if (x == 1) s3 = "Одна тысяча ";
			else if (x == 0) s3 = "тысяч ";
			y = y / 10;
			n = n - (x * 1000);
		}

		if (y == 100)
		{
			x = n / y;
			if (x == 9) s4 = "Девятьсот ";
			else if (x == 8) s4 = "Восемьсот ";
			else if (x == 7) s4 = "Семьсот ";
			else if (x == 6) s4 = "Шестьсот ";
			else if (x == 5) s4 = "Пятьсот ";
			else if (x == 4) s4 = "Четыреста ";
			else if (x == 3) s4 = "Триста ";
			else if (x == 2) s4 = "Двесте ";
			else if (x == 1) s4 = "Сто ";
			y = y / 10;
			n = n - (x * 100);
		}

		if (y == 10)
		{
			x = n / y;
			if (x == 9) s5 = "Девяносто ";
			else if (x == 8) s5 = "Восемьдесят ";
			else if (x == 7) s5 = "Семьдесят ";
			else if (x == 6) s5 = "Шестьдесят ";
			else if (x == 5) s5 = "Пятьдесят ";
			else if (x == 4) s5 = "Сорок ";
			else if (x == 3) s5 = "Тридцать ";
			else if (x == 2) s5 = "Двадцать ";
			else if (x == 1)
			{
				y = y / 10;
				n = n - (x * 10);
				x = n / y;
				if (x == 9) s5 = "Девятнадцать ";
				else if (x == 8) s5 = "Восемнадцать ";
				else if (x == 7) s5 = "Семнадцать ";
				else if (x == 6) s5 = "Шестнадцать ";
				else if (x == 5) s5 = "Пятнадцать ";
				else if (x == 4) s5 = "Четырнадцать ";
				else if (x == 3) s5 = "Тринадцать ";
				else if (x == 2) s5 = "Двенадцать ";
				else if (x == 1) s5 = "Одинадцать ";
				else if (x == 0) s5 = "Десять ";
				y = y / 10;
			}
			if (y == 10)
			{
				y = y / 10;
				n = n - (x * 10);
			}
		}

		if (y == 1)
		{
			x = n / y;
			if (x == 9) s6 = "Девять ";
			else if (x == 8) s6 = "Восемь ";
			else if (x == 7) s6 = "Семь ";
			else if (x == 6) s6 = "Шесть ";
			else if (x == 5) s6 = "Пять ";
			else if (x == 4) s6 = "Четыре ";
			else if (x == 3) s6 = "Три ";
			else if (x == 2) s6 = "Два ";
			else if (x == 1) s6 = "Один ";
		}

		s = s1 + s2 + s3 + s4 + s5 + s6;
		cout << "\nВы ввели число: " << s << "\n\n";
}
